//Первое задание.

let tC = +prompt('Введите температуру по цельсию');
let tF = (9 / 5) * tC + 32;
alert('Температура по Фарингейту равна ' + tF);

//Второе задание.

let admin = null;
let name = "Василий";
admin = name;
console.log('Переменная admin равна ' + admin);

// Третье задание

/* №1 result будет равен 2010
* 1. 10 + 10 = 20
* 2. затем происходит сложение числового типа со строчным (числовой не явно становится строчным)
* 3. В результате происходит конкатенация
* 4. Результат 2010 присваивается в переменную result
* 5. console.log выводит result в консоль
* */
let result = 10 + 10 + "10";
console.log(typeof(result));


/*№2 result2 будет равен 101010
* 1. 10 + "10" = 1010 (число не явно стало строкой и произошла конкатенация)
* 2. 1010 + 10 = 101010 (число не явно стало строкой и произошла конкатенация)
* 3. Результат 101010 присваивается в переменную result2
* 5. console.log выводит result2 в консоль*/

let result2 = 10 + "10" + 10;
console.log(typeof(result2));


/*№3 result3 будет равен 30
1. 10 + 10 = 20
2. 20 + +"10" = 30 (унарный плюс преобразовывает строку в число)
3. Результат 30 присваивается в result3
4. console.log выводит result3 в консоль*/

let result3 = 10 + 10 + +"10"
console.log(result3);


/*result4 будет равен -infinity
* так как -"" = -0, а при делении числа на -0 получаем значение -infinity
* Результат присваиваем перенной result4
*  console.log выводит result4 в консоль*/

let result4 = 10 / -"";
console.log(result4);


/*result5 будет равен NaN
* 1. 10 / +"2,5" = NaN
*Не совсем тут разобрался. Видимо при делении числа на NaN результатом будет являться NaN */
let a = +"2,5";
console.log(a);//выводит в консоль NaN
console.log(typeof(a));//выводит в консоль number
let result5 = 10 / +"2,5";
console.log(result5);